---
title: RepeaterCoordinates
classe: Autodesk.Revit.DB.RepeaterCoordinates
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# RepeaterCoordinates

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 DimensionCount { get; }` | `repeaterCoordinates.DimensionCount` | Int32 |
| `Boolean IsValidObject { get; }` | `repeaterCoordinates.IsValidObject` | Boolean |
| `Void Dispose()` | `repeaterCoordinates.Dispose()` | Void |
| `Int32 GetCoordinate(Int32)` | `repeaterCoordinates.GetCoordinate(dimension)` | Int32 |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```